# Brewfile - Homebrew Bundle Configuration
# Managed by chezmoi - syncs to ~/Brewfile
# Install with: brew bundle --global
# Update with: brew bundle dump --force --global

# ============================================================================
# TAPS - Custom Homebrew Repositories
# ============================================================================

tap "homebrew/services"          # Manage services with `brew services`
tap "mulbc/ceph-client"          # Ceph storage client tools
tap "nikitabobko/tap"            # AeroSpace window manager
tap "tools/core"                 # Core tools repository
tap "zurawiki/brews"             # Additional utilities

# ============================================================================
# DEVELOPMENT TOOLS - Programming Languages & Build Tools
# ============================================================================

# Programming Languages
brew "go"                         # Go programming language
brew "go@1.18"                    # Go 1.18 (specific version)
brew "node"                       # Node.js JavaScript runtime
brew "python@3.11"                # Python 3.11
brew "python@3.12"                # Python 3.12
brew "python@3.13"                # Python 3.13
brew "python@3.14"                # Python 3.14
brew "rust"                       # Rust programming language
brew "openjdk"                    # OpenJDK Java Development Kit

# Go Development Tools
brew "go-critic"                  # Go linter aggregator
brew "golangci-lint"              # Fast Go linters runner
brew "gopls"                      # Go language server
brew "goreleaser"                 # Release Go projects quickly
brew "mockery"                    # Mock code autogenerator for Go
brew "staticcheck"                # Go static analysis

# Python Tools
brew "pipx"                       # Install Python applications in isolated environments
brew "py3cairo"                   # Python 3 bindings for cairo
brew "pycparser"                  # C parser in Python
brew "pygobject3"                 # Python bindings for GObject
brew "python-certifi"             # Python package for Mozilla's CA bundle
brew "python-cryptography"        # Cryptographic recipes and primitives
brew "python-packaging"           # Core utilities for Python packages
brew "python-pyparsing"           # Python parsing module
brew "python-setuptools"          # Python setup tools
brew "uv"                         # Fast Python package installer

# Version Control & Git Tools
brew "git-delta"                  # Syntax-highlighting pager for git
brew "delta"                      # Syntax-highlighting pager for git, diff, and grep
brew "gptcommit"                  # Generate commit messages with GPT
brew "libgit2"                    # C library for Git

# Build & Deployment Tools
brew "cmake"                      # Cross-platform build system (likely installed as dependency)
brew "m4"                         # Macro processing language
brew "make"                       # Build automation tool (system default)

# ============================================================================
# KUBERNETES & CLOUD NATIVE TOOLS
# ============================================================================

brew "argocd"                     # GitOps continuous delivery for Kubernetes
brew "cmctl"                      # Cert-manager CLI tool
brew "container-structure-test"   # Validate container structure
brew "crane"                      # Tool for managing container images
brew "dive"                       # Explore Docker image layers
brew "etcd"                       # Distributed key-value store
brew "helm"                       # Kubernetes package manager
brew "istioctl"                   # Istio service mesh CLI
brew "k8sgpt"                     # Kubernetes cluster analysis
brew "k9s"                        # Kubernetes CLI manager
brew "kind"                       # Run local Kubernetes clusters
brew "ko"                         # Build and deploy Go apps on Kubernetes
brew "krew"                       # Kubectl plugin manager
brew "kubebuilder"                # SDK for building Kubernetes APIs
brew "kubectl-debug"              # Debug running pods
brew "kubectl-login"              # kubectl credential plugin
brew "kubernetes-cli"             # Kubernetes command-line interface
brew "kubevela"                   # Application delivery platform
brew "kustomize"                  # Kubernetes configuration customization
brew "minikube"                   # Run Kubernetes locally
brew "oras"                       # OCI Registry As Storage
brew "skopeo"                     # Work with remote container images
brew "step"                       # Crypto and x509 Swiss-Army-Knife
brew "stern"                      # Multi-pod log tailing
brew "telepresence"               # Local development against remote Kubernetes
brew "tilt"                       # Local Kubernetes development

# Cloud Tools
brew "openstackclient"            # OpenStack command-line client
brew "s3cmd"                      # S3 client tool

# ============================================================================
# SYSTEM UTILITIES & CLI TOOLS
# ============================================================================

# Modern CLI Replacements
brew "bat"                        # Cat clone with syntax highlighting
brew "fd"                         # Simple, fast alternative to find
brew "lsd"                        # Modern ls with colors and icons
brew "ripgrep"                    # Fast grep alternative
brew "sd"                         # Intuitive find & replace CLI

# File & Directory Tools
brew "ack"                        # Search tool like grep
brew "coreutils"                  # GNU core utilities
brew "cpio"                       # Archiving utility
brew "grep"                       # GNU grep
brew "gnu-sed"                    # GNU sed
brew "tree"                       # Display directory tree
brew "parallel"                   # Execute jobs in parallel
brew "pigz"                       # Parallel gzip
brew "watch"                      # Execute program periodically
brew "viddy"                      # Modern watch alternative
brew "hwatch"                     # Modern watch with highlighting

# Terminal & Shell
brew "atuin"                      # Shell history sync
brew "bash"                       # Bourne-Again SHell
brew "direnv"                     # Load/unload environment variables
brew "fish"                       # Friendly interactive shell
brew "fzf"                        # Command-line fuzzy finder
brew "mcfly"                      # Smart command history search
brew "nushell"                    # Modern shell with structured data
brew "tmux"                       # Terminal multiplexer
brew "zellij"                     # Terminal workspace

# System Monitoring & Info
brew "htop"                       # Interactive process viewer
brew "fio"                        # I/O benchmark and stress test
brew "iproute2mac"                # Linux iproute2 for macOS

# Text Processing & Search
brew "jq"                         # JSON processor
brew "yq"                         # YAML processor
brew "oniguruma"                  # Regular expressions library

# File Management
brew "exiftool"                   # Read/write meta info in files
brew "pandoc"                     # Universal document converter
brew "topgrade"                   # Upgrade all the things

# Dotfiles & Configuration Management
brew "chezmoi"                    # Manage dotfiles across machines
brew "yadm"                       # Yet Another Dotfiles Manager

# ============================================================================
# NETWORKING & SECURITY TOOLS
# ============================================================================

# Network Tools
brew "arping"                     # ARP-level ping
brew "curl"                       # Transfer data with URLs
brew "wget"                       # Internet file retriever
brew "httpie"                     # User-friendly HTTP client
brew "telnet"                     # Network protocol tool

# SSH & Remote Access
brew "expect"                     # Automate interactive applications
brew "ssh-login"                  # SSH login helper
brew "sshpass"                    # Non-interactive SSH password auth
brew "pssh"                       # Parallel SSH

# Security & Cryptography
brew "certbot"                    # Let's Encrypt certificate tool
brew "gnupg"                      # GNU Privacy Guard
brew "gpgme"                      # Library for GPG Made Easy
brew "libgpg-error"               # Error codes for GnuPG components
brew "pinentry"                   # Passphrase entry dialog

# SSL/TLS Libraries
brew "ca-certificates"            # Mozilla CA certificate bundle
brew "certifi"                    # Python SSL certificates
brew "gnutls"                     # GNU TLS library
brew "openssl@3"                  # OpenSSL cryptography library

# ============================================================================
# MEDIA & GRAPHICS TOOLS
# ============================================================================

# Video Processing
brew "ffmpeg"                     # Audio/video processing
brew "aribb24"                    # ARIB STD-B24 character set
brew "aom"                        # AV1 codec
brew "dav1d"                      # AV1 decoder
brew "faac"                       # AAC audio encoder
brew "faad2"                      # AAC audio decoder
brew "fdk-aac"                    # AAC codec library
brew "gst-libav"                  # GStreamer libav plugin
brew "gst-plugins-bad"            # GStreamer "bad" plugins
brew "gst-plugins-base"           # GStreamer base plugins
brew "gst-plugins-good"           # GStreamer "good" plugins
brew "gst-plugins-ugly"           # GStreamer "ugly" plugins
brew "gstreamer"                  # Multimedia framework
brew "libass"                     # Subtitle rendering library
brew "libbluray"                  # Blu-ray disc library
brew "libvidstab"                 # Video stabilization library
brew "libvmaf"                    # Video quality assessment
brew "libvpx"                     # VP8/VP9 codec
brew "opencore-amr"               # AMR speech codec
brew "opus"                       # Audio codec
brew "rav1e"                      # AV1 encoder
brew "rtmpdump"                   # RTMP streaming
brew "rubberband"                 # Audio time-stretching
brew "snappy"                     # Compression library
brew "speex"                      # Audio codec
brew "srt"                        # Secure Reliable Transport
brew "srtp"                       # Secure RTP
brew "svt-av1"                    # AV1 encoder/decoder
brew "theora"                     # Video codec
brew "vidstab"                    # Video stabilization (likely part of libvidstab)
brew "x264"                       # H.264 encoder
brew "x265"                       # H.265/HEVC encoder
brew "xvid"                       # MPEG-4 video codec
brew "zimg"                       # Image processing library

# Audio Processing
brew "flac"                       # Free lossless audio codec
brew "lame"                       # MP3 encoder
brew "libcuefile"                 # CUE file library
brew "libogg"                     # Ogg bitstream library
brew "libreplaygain"              # ReplayGain library
brew "libsamplerate"              # Sample rate converter
brew "libshout"                   # Icecast streaming library
brew "libsndfile"                 # Audio file library
brew "libvorbis"                  # Vorbis audio codec
brew "mpg123"                     # MP3 player and decoder
brew "musepack"                   # Audio compression format
brew "taglib"                     # Audio metadata library

# Image Processing
brew "imagemagick"                # Image manipulation
brew "exiftool"                   # Read/write image metadata
brew "giflib"                     # GIF library
brew "graphite2"                  # Font rendering engine
brew "highway"                    # Performance-portable SIMD
brew "imath"                      # Math library for graphics
brew "jasper"                     # JPEG-2000 library
brew "jpeg-turbo"                 # JPEG library
brew "jpeg-xl"                    # JPEG XL image format
brew "leptonica"                  # Image processing library
brew "libavif"                    # AVIF image format
brew "libde265"                   # H.265 decoder
brew "libheif"                    # HEIF/HEIC image format
brew "liblqr"                     # Seam-carving library
brew "libpng"                     # PNG library
brew "libraw"                     # Raw image decoder
brew "libtiff"                    # TIFF library
brew "libwebp"                    # WebP image format
brew "little-cms2"                # Color management engine
brew "netpbm"                     # Image format toolkit
brew "openexr"                    # HDR image format
brew "openjpeg"                   # JPEG 2000 codec
brew "openjph"                    # High-throughput JPEG 2000
brew "webp"                       # Image format

# Graphics Libraries
brew "cairo"                      # 2D graphics library
brew "fontconfig"                 # Font configuration library
brew "freetype"                   # Font rendering library
brew "frei0r"                     # Video effects plugins
brew "fribidi"                    # BiDi text library
brew "gd"                         # Graphics library
brew "harfbuzz"                   # Text shaping engine
brew "pango"                      # Text layout library
brew "pixman"                     # Low-level pixel manipulation

# Design & Diagramming
brew "d2"                         # Modern diagram scripting language
brew "graphviz"                   # Graph visualization

# ============================================================================
# SYSTEM LIBRARIES & DEPENDENCIES
# ============================================================================

# Compression & Archives
brew "brotli"                     # Compression algorithm
brew "libb2"                      # BLAKE2 crypto hash
brew "libarchive"                 # Multi-format archive library
brew "libdeflate"                 # Compression library
brew "lz4"                        # Fast compression
brew "lzo"                        # Real-time compression
brew "xz"                         # General-purpose data compression
brew "zlib"                       # Compression library (system)
brew "zopfli"                     # Zopfli compression
brew "zstd"                       # Fast compression

# Networking Libraries
brew "c-ares"                     # Async DNS resolver
brew "libmicrohttpd"              # HTTP server library
brew "libnet"                     # Packet construction library
brew "libnghttp2"                 # HTTP/2 library
brew "libnghttp3"                 # HTTP/3 library
brew "libngtcp2"                  # QUIC protocol library
brew "libnice"                    # ICE library for P2P
brew "libpsl"                     # Public Suffix List library
brew "libssh"                     # SSH library
brew "libssh2"                    # SSH2 client library
brew "libusrsctp"                 # SCTP library

# XML/Data Libraries
brew "libxml2"                    # XML parser library
brew "libyaml"                    # YAML parser library
brew "json-c"                     # JSON library in C
brew "json-glib"                  # JSON library for GLib
brew "simdjson"                   # JSON parser
brew "simdutf"                    # Unicode validation

# Cryptography & Security Libraries
brew "cryptography"               # Cryptographic recipes
brew "gmp"                        # GNU multiple precision library
brew "libassuan"                  # IPC library for GPG
brew "libgcrypt"                  # Cryptographic library
brew "libidn2"                    # Internationalized domain names
brew "libsodium"                  # Crypto library
brew "libtasn1"                   # ASN.1 structure parser
brew "mbedtls"                    # Crypto library for embedded
brew "nettle"                     # Cryptographic library
brew "p11-kit"                    # PKCS#11 library
brew "unbound"                    # DNS resolver

# Unicode & Text
brew "gettext"                    # GNU internationalization
brew "icu4c@76"                   # International Components for Unicode
brew "icu4c@77"                   # International Components for Unicode
brew "libunibreak"                # Line breaking library
brew "libunistring"               # Unicode string library
brew "pcre2"                      # Regular expression library
brew "utf8cpp"                    # UTF-8 C++ library
brew "utf8proc"                   # Unicode processing library

# Event & Process Libraries
brew "libevent"                   # Async event library
brew "libuv"                      # Multi-platform async I/O

# Miscellaneous Libraries
brew "augeas"                     # Configuration editing tool
brew "capstone"                   # Disassembly framework
brew "cjson"                      # JSON parser in C
brew "cunit"                      # C unit testing framework
brew "libzip"                     # ZIP library
brew "mpdecimal"                  # Decimal arithmetic library
brew "ncurses"                    # Terminal handling library
brew "readline"                   # Command-line editing library
brew "sqlite"                     # SQL database engine
brew "tcl-tk@8"                   # Tool Command Language
brew "z3"                         # Theorem prover
brew "zeromq"                     # High-performance messaging

# ============================================================================
# DESKTOP ENVIRONMENT LIBRARIES
# ============================================================================

# GTK & GNOME
brew "adwaita-icon-theme"         # GNOME icon theme
brew "at-spi2-core"               # Assistive technology
brew "atk"                        # Accessibility toolkit
brew "dbus"                       # Message bus system
brew "gdk-pixbuf"                 # Image loading library
brew "glib"                       # Core library
brew "glib-networking"            # Network extensions for GLib
brew "gobject-introspection"      # Generate language bindings
brew "graphene"                   # Thin layer of types for graphics
brew "gsettings-desktop-schemas"  # GSettings schemas
brew "gtk+3"                      # GTK+ 3 toolkit
brew "gtk4"                       # GTK 4 toolkit
brew "gtksourceview4"             # Text widget with syntax highlighting
brew "gtk-vnc"                    # VNC viewer widget for GTK
brew "gts"                        # GNU Triangulated Surface library
brew "hicolor-icon-theme"         # Icon theme
brew "libepoxy"                   # OpenGL function pointer management
brew "librsvg"                    # SVG rendering library
brew "libsoup"                    # HTTP client/server library
brew "shared-mime-info"           # MIME database
brew "vte3"                       # Terminal emulator widget

# X11 & Display
brew "libx11"                     # X11 client library
brew "libxau"                     # X11 authorization library
brew "libxcb"                     # X11 C Bindings library
brew "libxdmcp"                   # X11 Display Manager Control Protocol
brew "libxext"                    # X11 extensions library
brew "libxfixes"                  # X11 Xfixes extension
brew "libxi"                      # X11 Input extension
brew "libxrender"                 # X11 Render extension
brew "libxtst"                    # X11 Testing extension
brew "xorgproto"                  # X11 protocol headers

# ============================================================================
# VIRTUALIZATION & CONTAINERS
# ============================================================================

brew "docker"                     # Container runtime
brew "lima"                       # Linux virtual machines
brew "podman"                     # Container engine
brew "qemu"                       # Emulator and virtualizer

# Virtualization Libraries
brew "dtc"                        # Device tree compiler
brew "libiscsi"                   # iSCSI client library
brew "libslirp"                   # User-mode networking library
brew "libusb"                     # USB library
brew "libvirt"                    # Virtualization API
brew "libvirt-glib"               # GLib bindings for libvirt
brew "libvirt-python"             # Python bindings for libvirt
brew "osinfo-db"                  # Operating systems database
brew "phodav"                     # WebDAV server
brew "sdl2"                       # Media library
brew "spice-gtk"                  # GTK client for SPICE
brew "spice-protocol"             # SPICE protocol headers
brew "usb.ids"                    # USB device database
brew "usbredir"                   # USB traffic redirection
brew "vde"                        # Virtual Distributed Ethernet
brew "yajl"                       # JSON library

# ============================================================================
# DATABASE & DATA TOOLS
# ============================================================================

brew "sqlite"                     # SQL database
# Note: Other databases may be installed via Docker/Podman

# ============================================================================
# DOCUMENTATION & MARKUP
# ============================================================================

brew "docbook"                    # Standard SGML representation for technical documents
brew "docbook-xsl"                # XML stylesheets for DocBook
brew "pandoc"                     # Universal document converter
brew "tesseract"                  # OCR engine
brew "xmlto"                      # Convert XML to various formats

# ============================================================================
# WINDOW MANAGEMENT & SYSTEM TOOLS (macOS specific)
# ============================================================================

brew "sketchybar"                 # Customizable macOS status bar
brew "skhd"                       # Simple hotkey daemon for macOS
brew "terminal-notifier"          # Send macOS notifications

# ============================================================================
# MISCELLANEOUS CLI TOOLS
# ============================================================================

brew "bfg"                        # Remove large files from Git history
brew "gemini-cli"                 # Gemini protocol client
brew "glab"                       # GitLab CLI tool
brew "kestrel"                    # Log file analysis
brew "mas"                        # Mac App Store CLI
brew "orc"                        # Optimized Inner Loop Runtime Compiler
brew "tig"                        # Text-mode interface for Git
brew "yamllint"                   # YAML linter
brew "ytt"                        # YAML templating tool

# Additional language/runtime tools
brew "llvm"                       # Next-gen compiler infrastructure
brew "libomp"                     # OpenMP runtime

# ============================================================================
# GUI APPLICATIONS (Casks)
# ============================================================================

# Development & Programming
cask "claude"                     # Claude AI desktop app
cask "claude-code"                # Claude Code editor
cask "cursor"                     # AI-powered code editor
cask "doteditor"                  # Dot file editor
cask "jetbrains-toolbox"          # JetBrains tools manager
cask "sublime-text"               # Text editor
cask "visual-studio-code"         # VS Code editor
cask "visual-studio-code-insiders"# VS Code Insiders
cask "visual-studio-code@insiders"# VS Code Insiders (alternative)

# Terminals
cask "alacritty"                  # GPU-accelerated terminal
cask "ghostty"                    # Modern terminal emulator
cask "warp"                       # Modern terminal
cask "wezterm"                    # GPU-accelerated terminal

# Containers & Virtualization
cask "docker"                     # Docker Desktop
cask "docker-desktop"             # Docker Desktop (alternative)
cask "orbstack"                   # Fast, light Docker & Linux

# Browsers
cask "brave-browser"              # Privacy-focused browser
cask "google-chrome"              # Google Chrome
cask "microsoft-edge"             # Microsoft Edge

# Communication
cask "microsoft-outlook"          # Email client
cask "microsoft-teams"            # Team collaboration
cask "skype"                      # Video chat
cask "slack"                      # Team communication
cask "slack-cli"                  # Slack CLI
cask "telegram"                   # Messaging app
cask "whatsapp"                   # WhatsApp Desktop
cask "wechat"                     # WeChat messaging
cask "zoom"                       # Video conferencing

# Productivity & Notes
cask "notion"                     # Note-taking and collaboration
cask "obsidian"                   # Knowledge base app
cask "raycast"                    # Spotlight replacement

# Window Management & System Tools
cask "aerospace"                  # Tiling window manager
cask "caffeine"                   # Keep Mac awake
cask "dozer"                      # Hide menu bar icons
cask "karabiner-elements"         # Keyboard customizer
cask "lunar"                      # Display brightness control
cask "mos"                        # Mouse smoothing

# Input Devices
cask "logi-options+"              # Logitech Options+
cask "logi-options-plus"          # Logitech Options+ (alternative)
cask "logitech-options"           # Logitech Options

# Security & Authentication
cask "authy"                      # 2FA app
cask "vip-access"                 # Symantec VIP Access

# Media & Entertainment
cask "calibre"                    # E-book manager
cask "iina"                       # Modern media player
cask "plex"                       # Media server
cask "spotify"                    # Music streaming
cask "vlc"                        # Media player

# Adobe Suite
cask "adobe-acrobat-reader"       # PDF reader
cask "adobe-creative-cloud"       # Creative Cloud
cask "adobe-digital-editions"     # E-book reader

# Document & Publishing
cask "texifier"                   # LaTeX editor

# Network Analysis
cask "wireshark-app"              # Network protocol analyzer

# Fonts
cask "font-hack-nerd-font"        # Nerd Font - Hack
cask "font-inconsolata"           # Inconsolata font

# Microsoft
cask "microsoft-auto-update"      # Microsoft AutoUpdate

# ============================================================================
# MAC APP STORE APPLICATIONS
# ============================================================================

mas "AdGuard for Safari", id: 1440147259
mas "Microsoft PowerPoint", id: 462062816
mas "Negative", id: 1378123825
mas "Okta Verify", id: 490179405
mas "Sourcegraph for Safari", id: 1543262193
mas "Vimari", id: 1480933944
mas "Windows App", id: 1295203466
