# Brewfile - Homebrew Bundle Configuration
# Managed by chezmoi - syncs to ~/Brewfile
# Install with: brew bundle --global
# Update with: brew bundle dump --force --global

# ============================================================================
# TAPS - Custom Homebrew Repositories
# ============================================================================

tap "nikitabobko/tap"            # AeroSpace window manager

# ============================================================================
# DEVELOPMENT TOOLS - Programming Languages & Build Tools
# ============================================================================

# Programming Languages
brew "go"                         # Go programming language
brew "node"                       # Node.js JavaScript runtime

# Go Development Tools
brew "golangci-lint"              # Fast Go linters runner
brew "gopls"                      # Go language server
brew "goreleaser"                 # Release Go projects quickly

# Python Tools
brew "pipx"                       # Install Python applications in isolated environments
brew "uv"                         # Fast Python package installer

# Version Control & Git Tools
brew "delta"                      # Syntax-highlighting pager for git, diff, and grep

# Build & Deployment Tools
brew "make"                       # Build automation tool (system default)

# ============================================================================
# KUBERNETES & CLOUD NATIVE TOOLS
# ============================================================================

brew "argocd"                     # GitOps continuous delivery for Kubernetes
brew "cmctl"                      # Cert-manager CLI tool
brew "container-structure-test"   # Validate container structure
brew "crane"                      # Tool for managing container images
brew "dive"                       # Explore Docker image layers
brew "helm"                       # Kubernetes package manager
brew "k9s"                        # Kubernetes CLI manager
brew "ko"                         # Build and deploy Go apps on Kubernetes
brew "krew"                       # Kubectl plugin manager
brew "kubebuilder"                # SDK for building Kubernetes APIs
brew "kubernetes-cli"             # Kubernetes command-line interface
brew "stern"                      # Multi-pod log tailing

# Additional Kubernetes tools:
# brew "kubectl-debug"              # Debug running pods
# brew "kustomize"                  # Kubernetes configuration customization
# brew "oras"                       # OCI Registry As Storage
# brew "skopeo"                     # Work with remote container images

# Cloud Tools
# brew "openstackclient"            # OpenStack command-line client
# brew "s3cmd"                      # S3 client tool

# ============================================================================
# SYSTEM UTILITIES & CLI TOOLS
# ============================================================================

# Modern CLI Replacements
brew "fd"                         # Simple, fast alternative to find
brew "lsd"                        # Modern ls with colors and icons
brew "ripgrep"                    # Fast grep alternative
brew "sd"                         # Intuitive find & replace CLI

# File & Directory Tools
brew "ack"                        # Search tool like grep
brew "coreutils"                  # GNU core utilities
brew "gnu-sed"                    # GNU sed
brew "grep"                       # GNU grep
brew "hwatch"                     # Modern watch with highlighting
brew "tree"                       # Display directory tree

# Additional file & directory utilities:
# brew "cpio"                       # Archiving utility
# brew "parallel"                   # Execute jobs in parallel
# brew "pigz"                       # Parallel gzip
# brew "viddy"                      # Modern watch alternative
# brew "watch"                      # Execute program periodically

# Terminal & Shell
brew "atuin"                      # Shell history sync
brew "bash"                       # Bourne-Again SHell
brew "direnv"                     # Load/unload environment variables
brew "fish"                       # Friendly interactive shell
brew "fzf"                        # Command-line fuzzy finder
brew "tmux"                       # Terminal multiplexer
brew "tpm"                        # Tmux Plugin Manager

# System Monitoring & Info
brew "htop"                       # Interactive process viewer
# brew "fio"                        # I/O benchmark and stress test
# brew "iproute2mac"                # Linux iproute2 for macOS

# Text Processing & Search
brew "jq"                         # JSON processor
brew "yq"                         # YAML processor
# brew "oniguruma"                  # Regular expressions library

# File Management
# brew "exiftool"                   # Read/write meta info in files
# brew "pandoc"                     # Universal document converter
brew "topgrade"                   # Upgrade all the things

# Dotfiles & Configuration Management
brew "chezmoi"                    # Manage dotfiles across machines
# brew "yadm"                       # Yet Another Dotfiles Manager

# ============================================================================
# NETWORKING & SECURITY TOOLS
# ============================================================================

# Network Tools
brew "curl"                       # Transfer data with URLs
brew "httpie"                     # User-friendly HTTP client
brew "telnet"                     # Network protocol tool
brew "wget"                       # Internet file retriever

# Additional network tools:
# brew "arping"                     # ARP-level ping

# SSH & Remote Access
# brew "expect"                     # Automate interactive applications
# brew "sshpass"                    # Non-interactive SSH password auth
# brew "pssh"                       # Parallel SSH

# Security & Cryptography
# brew "certbot"                    # Let's Encrypt certificate tool
# brew "gnupg"                      # GNU Privacy Guard
# brew "gpgme"                      # Library for GPG Made Easy
# brew "libgpg-error"               # Error codes for GnuPG components
# brew "pinentry"                   # Passphrase entry dialog

# SSL/TLS Libraries
# brew "ca-certificates"            # Mozilla CA certificate bundle
# brew "certifi"                    # Python SSL certificates
# brew "gnutls"                     # GNU TLS library
brew "openssl@3"                  # OpenSSL cryptography library

# ============================================================================
# MEDIA & GRAPHICS TOOLS
# ============================================================================

# Design & Diagramming
brew "d2"                         # Modern diagram scripting language
# brew "graphviz"                   # Graph visualization

# ============================================================================
# MISCELLANEOUS CLI TOOLS
# ============================================================================

brew "glab"                       # GitLab CLI tool
brew "mas"                        # Mac App Store CLI
brew "ytt"                        # YAML templating tool

# Additional CLI tools:
# brew "bfg"                        # Remove large files from Git history
# brew "gemini-cli"                 # Gemini protocol client
# brew "terminal-notifier"          # Send macOS notifications

# ============================================================================
# GUI APPLICATIONS (Casks)
# ============================================================================

# Development & Programming
cask "claude"                     # Claude AI desktop app
cask "claude-code"                # Claude Code editor
cask "cursor"                     # AI-powered code editor
cask "visual-studio-code"         # VS Code editor

# Additional development tools:
# cask "doteditor"                  # Dot file editor
# cask "jetbrains-toolbox"          # JetBrains tools manager
# cask "sublime-text"               # Text editor
# cask "visual-studio-code-insiders"# VS Code Insiders
# cask "visual-studio-code@insiders"# VS Code Insiders (alternative)

# Terminals
cask "alacritty"                  # GPU-accelerated terminal

# Containers & Virtualization
# cask "docker"                     # Docker Desktop
# cask "docker-desktop"             # Docker Desktop (alternative)
cask "orbstack"                   # Fast, light Docker & Linux

# Browsers
# cask "brave-browser"              # Privacy-focused browser
# cask "google-chrome"              # Google Chrome
# cask "microsoft-edge"             # Microsoft Edge

# Communication
cask "slack"                      # Team communication
cask "telegram"                   # Messaging app
cask "whatsapp"                   # WhatsApp Desktop

# Additional communication tools:
# cask "microsoft-outlook"          # Email client
# cask "microsoft-teams"            # Team collaboration
# cask "skype"                      # Video chat
# cask "slack-cli"                  # Slack CLI
# cask "wechat"                     # WeChat messaging
# cask "zoom"                       # Video conferencing

# Productivity & Notes
# cask "notion"                     # Note-taking and collaboration
cask "obsidian"                   # Knowledge base app
cask "raycast"                    # Spotlight replacement
cask "voiceink"                   # Voice dictation tool

# Window Management & System Tools
cask "aerospace"                  # Tiling window manager
cask "karabiner-elements"         # Keyboard customizer
cask "mos"                        # Mouse smoothing

# Additional system tools:
# cask "caffeine"                   # Keep Mac awake
# cask "dozer"                      # Hide menu bar icons
# cask "lunar"                      # Display brightness control

# Input Devices
cask "logi-options+"              # Logitech Options+

# Alternative Logitech packages:
# cask "logi-options-plus"          # Logitech Options+ (alternative)
# cask "logitech-options"           # Logitech Options

# Security & Authentication
# cask "authy"                      # 2FA app
# cask "vip-access"                 # Symantec VIP Access

# Media & Entertainment
# cask "calibre"                    # E-book manager
# cask "iina"                       # Modern media player
# cask "plex"                       # Media server
cask "spotify"                    # Music streaming
# cask "vlc"                        # Media player

# Adobe Suite
# cask "adobe-acrobat-reader"       # PDF reader
# cask "adobe-creative-cloud"       # Creative Cloud
# cask "adobe-digital-editions"     # E-book reader

# Document & Publishing
# cask "texifier"                   # LaTeX editor

# Network Analysis
# cask "wireshark-app"              # Network protocol analyzer

# Fonts
cask "font-meslo-lg-nerd-font"    # Meslo LG Nerd Font

# Additional fonts:
# cask "font-hack-nerd-font"        # Nerd Font - Hack
# cask "font-inconsolata"           # Inconsolata font

# ============================================================================
# MAC APP STORE APPLICATIONS
# ============================================================================

mas "AdGuard for Safari", id: 1440147259
# mas "Sourcegraph for Safari", id: 1543262193
# mas "Vimari", id: 1480933944
